Revit 2026 API

# RevitAPIPreEventArgs Properties

---

The RevitAPIPreEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

#### Reference

RevitAPIPreEventArgs Class

Autodesk.Revit.DB.Events Namespace